# Brew bundle command list
# see https://github.com/Homebrew/homebrew-bundle
# brew bundle: Brewfileから一括ダウンロード
# brew bundle dump: ダウンロードリストをダンプ
# brew bundle cleanup: リストにないものを削除する
# brew bundle check: リストにあるもののうちアップグレードが必要なものをリストアップ
# brew bundle list: リストを一覧表示する

# Brewfile
cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/core"

brew "curl"
brew "docker", link: false
brew "gist"
brew "git"
brew "go"
brew "imagemagick"
brew "nodebrew"
brew "openssl"
brew "peco"
brew "shellcheck"
brew "p7zip"
brew "python"
brew "tmux"
brew "terraform"
brew "terraformer"
brew "tfenv", link: false
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"

# cask
cask "alfred"
cask "appcleaner"
cask "atom"
cask "caffeine"
cask "coteditor"
cask "docker"
cask "discord"
cask "dropbox"
cask "evernote"
cask "franz"
cask "gimp"
cask "google-chrome"
cask "google-japanese-ime"
cask "github"
cask "gyazo"
cask "hyper" 
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "kindle"
cask "scroll-reverser"
cask "spectacle"
cask "slack"
cask "visual-studio-code"
cask "zoom"
