cask_args appdir: "/Applications"

# tap
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"

# brew
brew "chezmoi"
brew "curl"
brew "ffmpeg"
brew "gist"
brew "git"
brew "goenv"
brew "imagemagick"
brew "openssl"
brew "p7zip"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh-completions"
brew "zsh"

# cask
cask "appcleaner"
cask "caffeine"
cask "cheatsheet"
cask "coteditor"
cask "cyberduck"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "github"
cask "google-chrome"
cask "google-japanese-ime"
cask "hyperswitch"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "microsoft-remote-desktop"
cask "notion"
cask "proxyman"
cask "r"
cask "raycast"
cask "rectangle"
cask "rstudio"
cask "scroll-reverser"
cask "skitch"
cask "slack"
cask "todoist"
cask "virtualbox"
cask "visual-studio-code"
cask "zoom"
