cask_args appdir: "/Applications"

# tap
tap "homebrew/bundle"

# brew
brew "chezmoi"
brew "curl"
brew "docker-compose"
brew "ffmpeg"
brew "gist"
brew "git"
brew "goenv"
brew "imagemagick"
brew "openssl"
brew "p7zip"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vim"
brew "uv"
brew "wget"
brew "zsh"
brew "rbenv"

# cask
cask "appcleaner"
cask "caffeine"
cask "cheatsheet"
cask "coteditor"
cask "cyberduck"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "github"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "hyperswitch"
cask "imagej"
cask "karabiner-elements"
cask "proxyman"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "skitch"
cask "todoist"
cask "virtualbox"
cask "visual-studio-code"
cask "zoom"
