cask_args appdir: "/Applications"

# tap
tap "homebrew/bundle"

# brew
brew "chezmoi"
brew "curl"
brew "docker-compose"
brew "ffmpeg"
brew "gist"
brew "git"
brew "goenv"
brew "imagemagick"
brew "openssl"
brew "p7zip"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vim"
brew "uv"
brew "wget"
brew "zsh"
brew "rbenv"

# cask
cask "appcleaner"
cask "caffeine"
cask "coteditor"
cask "cyberduck"
cask "gcloud-cli"
cask "karabiner-elements"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "skitch"
