cask_args appdir: "/Applications"

# tap
tap "homebrew/bundle"

# brew
brew "sheldon"
brew "gist"
brew "git"
brew "imagemagick"
brew "openssl"
brew "p7zip"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "neovim"
brew "eza"

# cask
cask "appcleaner"
cask "caffeine"
cask "coteditor"
cask "cyberduck"
cask "gcloud-cli"
cask "karabiner-elements"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "skitch"
cask "docker-desktop"
